/**
 * @file  CommandRegistry.hpp
 *
 */
#pragma once
#define AUTO_GENERATED
#include "llapi/Global.h"
#include "Json.hpp"

#define BEFORE_EXTRA
#include <memory>
#include "typeid_t.hpp"
// Include Headers or Declare Types Here
class CommandParameterData;
#include "CommandFlag.hpp"
#include "CommandPosition.hpp"
#include "CommandPositionFloat.hpp"
#include "CommandMessage.hpp"
#include "CommandSelector.hpp"
#include "CommandOrigin.hpp"
#include "CommandVersion.hpp"
#include "CommandRawText.hpp"
#include "CommandItem.hpp"
#include "CommandIntegerRange.hpp"
#include "CommandBlockName.hpp"
#include "ActorDamageSource.hpp"

#undef BEFORE_EXTRA

/**
 * @brief MC class CommandRegistry.
 *
 */
class CommandRegistry {

#define AFTER_EXTRA
    // Add Member There

public:
    struct ParseTable;
    class Symbol {
    public:
        int val;
        MCAPI Symbol(unsigned __int64 = -1);
        MCAPI Symbol(class Symbol const&);
        MCAPI unsigned __int64 toIndex() const;
        MCAPI int value() const;
        inline bool operator==(Symbol const& right) const {
            return val == right.val;
        }
        [[nodiscard]] inline std::string toString() const {
            return Global<CommandRegistry>->symbolToString(*this);
        }
        [[nodiscard]] inline std::string toDebugString() const {
            return fmt::format("<Symbol {}({})>", toString(), val);
        }
    };

    struct ParseToken {
        std::unique_ptr<CommandRegistry::ParseToken> child;
        std::unique_ptr<CommandRegistry::ParseToken> next;
        CommandRegistry::ParseToken* parent;
        const char* text; // 24
        uint32_t length;  // 32
        Symbol type;      // 36
        MCAPI std::string toString() const;
        //{
        //    if (text)
        //        return std::string(text, length);
        //    auto v6 = child.get();
        //    auto v8 = child.get();
        //    while (v8->child)
        //    {
        //        v8 = v8->child.get();
        //    }
        //    while (v6->child || v6->next)
        //    {
        //        v6 = v6->next ? v6->next.get() : v6->child.get();
        //    }
        //    auto v10 = v6->text + v6->length;
        //    auto v11 = v8->text;
        //    return std::string(v11, v10 - v11);
        //};
        [[nodiscard]] inline std::string toDebugString() const {
            return fmt::format("<ParseToken {}>", toString());
        }
    };
    static_assert(sizeof(ParseToken) == 40);
    using ParseFn = bool (CommandRegistry::*)(
        void*, ParseToken const&, CommandOrigin const&, int, std::string&,
        std::vector<std::string>&) const;

    struct Overload {
        using FactoryFn = std::unique_ptr<class Command> (*)();

        CommandVersion version;                   // 0
        FactoryFn factory;                        // 8
        std::vector<CommandParameterData> params; // 16
        unsigned char unk;                        // 40
        std::vector<Symbol> syms = {};            // 48

        LIAPI Overload(CommandVersion version,
                       FactoryFn factory,
                       std::vector<CommandParameterData>&& args);

        LIAPI ~Overload();

        inline std::string toDebugString() {
            return fmt::format("<Overload>");
        }
    };

    struct Signature {
        std::string name;                // 0
        std::string desc;                // 32
        std::vector<Overload> overloads; // 64
        CommandPermissionLevel perm;     // 88
        Symbol main_symbol;              // 92
        Symbol alt_symbol;               // 96
        CommandFlag flag;                // 100
        int firstRule;
        int firstFactorization;
        int firstOptional;
        bool runnable;

        inline Signature(std::string_view name,
                         std::string_view desc,
                         CommandPermissionLevel perm,
                         Symbol symbol,
                         CommandFlag flag)
        : name(name), desc(desc), perm(perm), main_symbol(symbol), flag(flag) {
        }

        inline std::string toDebugString() const {
            return fmt::format("<Signature {}>", name);
        }
    };

    struct SoftEnum {
        std::string name;              // 0
        std::vector<std::string> list; // 32
    };

    struct Enum {
        std::string name;                                                                           // 0
        typeid_t<CommandRegistry> type;                                                             // 32
        ParseFn parse;                                                                              // 40
        std::vector<std::tuple<unsigned long, unsigned long, unsigned long, unsigned long>> values; // 48

        inline std::string toDebugString() const {
            return fmt::format("<Enum {}>", name);
        }
    };

    LIAPI static std::vector<std::string> getEnumNames();
    LIAPI static std::vector<std::string> getSoftEnumNames();
    LIAPI static std::vector<std::string> getEnumValues(std::string const& name);
    LIAPI static std::vector<std::string> getSoftEnumValues(std::string const& name);
    LIAPI static std::string getCommandFullName(std::string const& name);
    // Experiment
    LIAPI bool unregisterCommand(std::string const& name);

    template <typename Type>
    struct DefaultIdConverter {
        template <typename Target, typename Source>
        static Target convert(Source source) {
            return (Target)source;
        }
        uint64_t operator()(Type value) const {
            return convert<uint64_t, Type>(value);
        }
        Type operator()(uint64_t value) const {
            return convert<Type, uint64_t>(value);
        }
    };

#ifdef COMMAND_REGISTRY_EXTRA
    inline static std::string toString(std::vector<Symbol> const& syms) {
        std::ostringstream oss;
        bool first = true;
        for (auto& sym : syms) {
            if (!first)
                oss << ", ";
            oss << sym.toString();
            first = false;
        }
        return oss.str();
    }
    struct ParseRule {
        Symbol sym;
        std::function<ParseToken*(ParseToken&, Symbol)> func;
        std::vector<Symbol> syms;
        CommandVersion version;
        inline std::string toDebugString() const {

            return fmt::format("<ParseRule {} - [{}]>", sym.toDebugString(), toString(syms));
        }
    };
    struct ParseTable {
        std::map<Symbol, std::vector<Symbol>> first;
        std::map<Symbol, std::vector<Symbol>> follow;
        std::map<std::pair<Symbol, Symbol>, int> predict;
        inline std::string toDebugString() const {
            std::ostringstream oss;
            bool f = true;
            for (auto& [k, v] : first) {
                if (!f)
                    oss << ", ";
                oss << k.toString() << ":[" << toString(v) << "]";
                f = false;
            }
            oss << "\n";
            for (auto& [k, v] : follow) {
                if (!f)
                    oss << ", ";
                oss << k.toString() << ":[" << toString(v) << "]";
                f = false;
            }
            return fmt::format("<ParseTable>[{}]", oss.str());
        }
    };
    struct OptionalParameterChain {
        int parameterCount;
        int followingRuleIndex;
        Symbol paramSymbol;
        inline std::string toDebugString() const {
            return fmt::format("<OptionalParameterChain {},{},{}>", parameterCount, followingRuleIndex, paramSymbol.toDebugString());
        }
    };
    struct Factorization {
        Symbol sym;
        inline std::string toDebugString() const {
            return fmt::format("<Factorization {}>", sym.toDebugString());
        }
    };
    struct RegistryState {
        int signatureCount;
        int enumValueCount;
        int postfixCount;
        int enumCount;
        int factorizationCount;
        int optionalCount;
        int ruleCount;
        int softEnumCount;
        int constraintCount;
        std::vector<unsigned int> constrainedValueCount;
        std::vector<unsigned int> softEnumValuesCount;
    };
    struct ConstrainedValue {
        Symbol mValue;
        Symbol mEnum;
        std::vector<unsigned char> mConstraints;
        inline std::string toDebugString() const {
            std::ostringstream oss;
            bool first = true;
            for (auto& i : mConstraints) {
                if (!first)
                    oss << ", ";
                oss << (int)i;
                first = false;
            }
            return fmt::format("<ConstrainedValue {} - {} - [{}]>", mValue.toDebugString(), mEnum.toDebugString(), oss.str());
        }
    };

    using CommandOverrideFunctor = std::function<void __cdecl(struct CommandFlag&, class std::basic_string<char, struct std::char_traits<char>, class std::allocator<char>> const&)>;
    using ParamSymbols = std::array<Symbol, 21>;

    std::function<void(const class Packet&)> mGetScoreForObjective;  // 0
    std::function<void(const class Packet&)> mNetworkUpdateCallback; // 64
    std::vector<ParseRule> mRules;                                   // 128
    // map<command version, ParseTable>
    std::map<unsigned int, ParseTable> mParseTableMap;                                      // 152
    std::vector<OptionalParameterChain> mOptionals;                                         // 168
    std::vector<std::string> mEnumValues;                                                   // 192
    std::vector<Enum> mEnums;                                                               // 216
    std::vector<Factorization> mFactorizations;                                             // 240
    std::vector<std::string> mPostfixes;                                                    // 264
    std::map<std::string, unsigned int> mEnumLookup;                                        // 288
    std::map<std::string, unsigned long> mEnumValueLookup;                                  // 304
    std::vector<Symbol> mCommandSymbols;                                                    // 320
    std::map<std::string, Signature> mSignatures;                                           // 344
    std::map<typeid_t<CommandRegistry>, int> mTypeLookup;                                   // 360
    std::map<char, char> unk376;                                                            // 376
    std::map<std::string, std::string> mAliases;                                            // 392
    std::vector<SemanticConstraint> mSemanticConstraints;                                   // 408
    std::map<SemanticConstraint, unsigned char> mSemanticConstraintLookup;                  // 432
    std::vector<ConstrainedValue> mConstrainedValues;                                       // 448
    std::map<std::pair<unsigned long, unsigned int>, unsigned int> mConstrainedValueLookup; // 472
    std::vector<SoftEnum> mSoftEnums;                                                       // 488
    std::map<std::string, unsigned int> mSoftEnumLookup;                                    // 512
    std::vector<RegistryState> mStateStack;                                                 // 528
    ParamSymbols mArgs;                                                                     // 552
    CommandOverrideFunctor mCommandOverrideFunctor;                                         // 640
    // 704

    inline void printAll() const;
    inline void printSize() const;

    void test() {
        auto mParseTableMapCopy = mParseTableMap;
        auto mEnumLookupCopy = mEnumLookup;
        auto mEnumValueLookupCopy = mEnumValueLookup;
        auto mSignaturesCopy = mSignatures;
        auto mTypeLookupCopy = mTypeLookup;
        auto unk376Copy = unk376;
        auto mAliasesCopy = mAliases;
        auto mSemanticConstraintLookupCopy = mSemanticConstraintLookup;
        auto mConstrainedValueLookupCopy = mConstrainedValueLookup;
        auto mSoftEnumLookupCopy = mSoftEnumLookup;

        constexpr auto size = sizeof(CommandRegistry);

        static_assert(sizeof(Enum) == 72);
        static_assert(sizeof(ParseTable) == 48);
        static_assert(sizeof(ParseRule) == 104);
        static_assert(sizeof(CommandRegistry) == 0x2c0);
