// This Header is auto generated by BDSLiteLoader Toolchain
#pragma once
#define AUTO_GENERATED
#include "../Global.h"
#include "Packet.hpp"

#define BEFORE_EXTRA
// Include Headers or Declare Types Here

#undef BEFORE_EXTRA

class AvailableCommandsPacket : public Packet {

#define AFTER_EXTRA
// Add Member There
    struct EnumData
    {
        std::string name;
        std::vector<unsigned int> valueIndices;
    };//56
    struct ConstrainedValueData
    {
        int enumIndex;
        int enumNameIndex;
        std::vector<unsigned char> unk8;
    };
    struct OverloadData
    {
    };
    struct ParamData
    {
    };
    struct CommandData
    {
        std::string commandName;
        std::vector<void*> enumIndices;
        std::vector<void*> suffixIndices;
        std::vector<void*> dynamicEnumIndices;
    };//104
    struct SoftEnumData
    {
        std::string name;
        std::vector<std::string> values;
    };//56

std::vector<std::string> mAllEnums;//48
std::vector<std::string> mAllSuffix;//72
std::vector<EnumData> mEnumDatas;//96
std::vector<CommandData> mCommandDatas;//120
std::vector<SoftEnumData> mSoftEnums;//144
std::vector<ConstrainedValueData> mConstrainedValueDatas; //168
public:
inline void test()
{
    std::vector<std::tuple<std::string, std::string, char>> datas;
    for (auto& i : mConstrainedValueDatas) {
        datas.push_back(std::tuple{mAllEnums.at(i.enumIndex), mEnumDatas.at(i.enumNameIndex).name, i.unk8[0]});
        if (mEnumDatas.at(i.enumNameIndex).name == "CommandName")
            i.unk8[0] = '\x1';
    }
    static_assert(sizeof(AvailableCommandsPacket) == 192);
    static_assert(sizeof(EnumData) == 56);
    static_assert(sizeof(CommandData) == 104);
    static_assert(offsetof(AvailableCommandsPacket, mAllEnums) == 48);
    static_assert(offsetof(AvailableCommandsPacket, mAllSuffix) == 72);
    static_assert(offsetof(AvailableCommandsPacket, mConstrainedValueDatas) == 168);
}
#undef AFTER_EXTRA

#ifndef DISABLE_CONSTRUCTOR_PREVENTION_AVAILABLECOMMANDSPACKET
public:
    class AvailableCommandsPacket& operator=(class AvailableCommandsPacket const&) = delete;
    AvailableCommandsPacket(class AvailableCommandsPacket const&) = delete;
#endif

public:
    /*0*/ virtual ~AvailableCommandsPacket();
    /*1*/ virtual enum MinecraftPacketIds getId() const;
    /*2*/ virtual std::string getName() const;
    /*3*/ virtual void write(class BinaryStream&) const;
    /*6*/ virtual enum StreamReadResult _read(class ReadOnlyBinaryStream&);
    /*
    inline  ~AvailableCommandsPacket(){
         (AvailableCommandsPacket::*rv)();
        *((void**)&rv) = dlsym("??1AvailableCommandsPacket@@UEAA@XZ");
        return (this->*rv)();
    }
    */
    MCAPI AvailableCommandsPacket(std::vector<std::string> const&, std::vector<std::string> const&, std::vector<struct AvailableCommandsPacket::EnumData>&&, std::vector<struct AvailableCommandsPacket::ConstrainedValueData>&&, std::vector<struct AvailableCommandsPacket::CommandData>&&, std::vector<struct AvailableCommandsPacket::SoftEnumData>&&);
    MCAPI AvailableCommandsPacket();

protected:

private:

};